Terraform Plan:
```aws_cloudwatch_log_group.ecs_log_group: Refreshing state... [id=/ecs/siem]
aws_vpc.main: Refreshing state... [id=vpc-03e05ec4d7ef91467]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-013904bf197fc22ee]
aws_ebs_volume.gp3_volume_grafana: Refreshing state... [id=vol-046731b68b9381cc7]
aws_ebs_volume.gp3_volume_prometheus: Refreshing state... [id=vol-099aaae27ba9c2e1d]
aws_iam_role.ec2_instance_role: Refreshing state... [id=ec2-instance-role-generic]
aws_ebs_volume.gp3_volume_wazuh-indexer: Refreshing state... [id=vol-0fef670bbba91e14b]
aws_iam_role_policy_attachment.cloudwatch_agent_server_policy: Refreshing state... [id=ec2-instance-role-generic-20240126004538603800000002]
aws_iam_role_policy_attachment.ssm_managed_instance_core: Refreshing state... [id=ec2-instance-role-generic-20240126004538591100000001]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ec2-instance-profile]
aws_internet_gateway.gw: Refreshing state... [id=igw-04d2dae30427425bb]
aws_subnet.public2: Refreshing state... [id=subnet-0aaf48c52ec90dd1a]
aws_subnet.private1: Refreshing state... [id=subnet-0a892d70c825f21bc]
aws_lb_target_group.wazuh_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/wazuh-tg/f82d94e88c55eb4e]
aws_subnet.public1: Refreshing state... [id=subnet-03d02c1913e5a7e17]
aws_subnet.private2: Refreshing state... [id=subnet-0c554a1b8323b1de4]
aws_security_group.all: Refreshing state... [id=sg-022d663f4177b31cd]
aws_lb_target_group.grafana_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/21e0efed84b17b1a]
aws_route_table.public: Refreshing state... [id=rtb-07d5e5349f9e26179]
aws_nat_gateway.nat: Refreshing state... [id=nat-087a3050e779ad781]
aws_lb.soc_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/soc-alb/894bb79551ab6cb7]
aws_route_table_association.public2: Refreshing state... [id=rtbassoc-090db73de77cde073]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-029d604ae22b397e3]
module.ec2_grafana.aws_instance.this[0]: Refreshing state... [id=i-08bd6045feda93592]
module.ec2_wazuh-indexer-01.aws_instance.this[0]: Refreshing state... [id=i-020ee2d56341b4bd9]
module.ec2_prometheus.aws_instance.this[0]: Refreshing state... [id=i-0e7de500b79a83df6]
aws_route_table.private: Refreshing state... [id=rtb-0ac24f37859269d8f]
aws_route_table_association.private2: Refreshing state... [id=rtbassoc-02605b946f56d70ea]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-01b8de58aaedb4470]
aws_lb_listener.wazuh_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/soc-alb/894bb79551ab6cb7/818729ffd897c3ab]
aws_lb_listener.grafana_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/soc-alb/894bb79551ab6cb7/a6c08888949fa450]
aws_volume_attachment.ebs_att_grafana: Refreshing state... [id=vai-465159468]
aws_lb_target_group_attachment.grafana_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/21e0efed84b17b1a-20240126003225435200000001]
aws_lb_target_group_attachment.wazuh_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/wazuh-tg/f82d94e88c55eb4e-20240127050235591300000001]
aws_volume_attachment.ebs_att_wazuh-indexer-01: Refreshing state... [id=vai-2087835945]
aws_volume_attachment.ebs_att_prometheus: Refreshing state... [id=vai-3835864464]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.apse2_wildcard_cert will be created
  + resource "aws_acm_certificate" "apse2_wildcard_cert" {
      + arn                       = (known after apply)
      + domain_name               = "*.apse2.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.apse2.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.apse2.com",
        ]
      + tags                      = {
          + "Name" = "apse2WildcardCert"
        }
      + tags_all                  = {
          + "Name" = "apse2WildcardCert"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.apse2_wildcard_cert_validation will be created
  + resource "aws_acm_certificate_validation" "apse2_wildcard_cert_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_lb_listener.grafana_listener will be updated in-place
  ~ resource "aws_lb_listener" "grafana_listener" {
      + certificate_arn   = (known after apply)
        id                = "arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/soc-alb/894bb79551ab6cb7/a6c08888949fa450"
      ~ port              = 80 -> 443
      ~ protocol          = "HTTP" -> "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
        tags              = {}
        # (3 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/21e0efed84b17b1a" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.grafana_tg must be replaced
-/+ resource "aws_lb_target_group" "grafana_tg" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/21e0efed84b17b1a" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/grafana-tg/21e0efed84b17b1a" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/21e0efed84b17b1a" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "grafana-tg"
      + name_prefix                        = (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol                           = "HTTP" -> "HTTPS" # forces replacement
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200-299" -> "200-399"
            # (8 unchanged attributes hidden)
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}

      - target_health_state {}
    }

  # aws_lb_target_group.wazuh_tg will be updated in-place
  ~ resource "aws_lb_target_group" "wazuh_tg" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/wazuh-tg/f82d94e88c55eb4e"
        name                               = "wazuh-tg"
        tags                               = {}
        # (16 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200-399" -> "200-299"
          ~ protocol            = "HTTPS" -> "HTTP"
            # (7 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lb_target_group_attachment.grafana_attachment must be replaced
-/+ resource "aws_lb_target_group_attachment" "grafana_attachment" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/21e0efed84b17b1a-20240126003225435200000001" -> (known after apply)
      ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/21e0efed84b17b1a" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.apse2_wildcard_cert_validation["*.apse2.com"] will be created
  + resource "aws_route53_record" "apse2_wildcard_cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.apse2 will be created
  + resource "aws_route53_zone" "apse2" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "apse2.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

  # module.ec2_wazuh-indexer-01.aws_instance.this[0] will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-020ee2d56341b4bd9"
        tags                                 = {
            "Environment" = "prod"
            "Name"        = "wazuh-indexer-01"
            "Terraform"   = "true"
        }
      ~ volume_tags                          = {
          ~ "Name" = "wazuh_indexer_01_persistence" -> "wazuh-indexer-01"
        }
        # (30 unchanged attributes hidden)

        # (10 unchanged blocks hidden)
    }

Plan: 6 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```